<?php
// Heading
$_['heading_title']              = 'Playful Sparkle - COD fee';
$_['heading_getting_started']    = 'Начало работы';
$_['heading_setup']              = 'Настройка COD fee';
$_['heading_faq']                = 'Часто задаваемые вопросы';
$_['heading_contact']            = 'Контактная поддержка';

// Text
$_['text_extension']             = 'Расширения';
$_['text_success']               = 'Успех: Вы изменили комиссию за наложенный платеж!';
$_['text_edit']                  = 'Редактировать комиссию за наложенный платеж';
$_['text_getting_started']       = '<p><strong>Обзор:</strong> Расширение Playful Sparkle - COD fee для OpenCart 4.x позволяет владельцам магазинов автоматически добавлять настраиваемую комиссию к заказам, оформленным с использованием метода оплаты наложенным платежом (COD). Это помогает компенсировать транзакционные расходы или дополнительные сборы, связанные с COD, обеспечивая гибкость и контроль над итоговой суммой заказа.</p><p><strong>Требования:</strong> OpenCart 4.x+, PHP 7.4+ или выше.</p>';
$_['text_setup']                 = '<p>Для настройки укажите желаемую сумму комиссии, которая будет применяться при оформлении заказа, выберите соответствующий класс налога и включите расширение. После настройки комиссия будет автоматически добавляться, когда клиент выберет оплату наложенным платежом (COD) при оформлении заказа.</p>';
$_['text_faq']                   = '<details><summary>Сумма комиссии указывается с учетом налога или без?</summary>Комиссия применяется с учетом налога. Например, если вы установите комиссию в 5 евро, то 5 евро будет добавлено к общей сумме заказа с учетом налога.</details><details><summary>Могу ли я установить разные комиссии для других способов оплаты?</summary>Нет, это расширение применяет комиссию только для метода оплаты наложенным платежом (COD).</details><details><summary>Будет ли комиссия отображаться отдельно в сводке заказа?</summary>Да, комиссия отображается как отдельная строка в разборе общей суммы заказа при оформлении заказа.</details>';
$_['text_contact']               = '<p>Для получения дополнительной помощи, пожалуйста, свяжитесь с нашей службой поддержки:</p><ul><li><strong>Контакт:</strong> <a href="mailto:%s">%s</a></li><li><strong>Документация:</strong> <a href="%s" target="_blank" rel="noopener noreferrer">Документация пользователя</a></li></ul>';

// Tab
$_['tab_general']                = 'Общее';
$_['tab_help_and_support']       = 'Помощь и поддержка';

// Entry
$_['entry_fee']                  = 'Комиссия';
$_['entry_tax_class']            = 'Налоговый класс';
$_['entry_status']               = 'Статус';
$_['entry_sort_order']           = 'Порядок сортировки';

// Error
$_['error_total_ps_cod_fee_fee'] = 'Комиссия не может быть пустой, меньше или равной нулю';

// Error
$_['error_permission']           = 'Предупреждение: У вас нет прав для изменения комиссии за наложенный платеж!';
