<?php
// Heading
$_['heading_title']              = 'Playful Sparkle - Χρέωση Αντικαταβολής';
$_['heading_getting_started']    = 'Έναρξη Χρήσης';
$_['heading_setup']              = 'Ρύθμιση Χρέωσης Αντικαταβολής';
$_['heading_faq']                = 'Συχνές Ερωτήσεις';
$_['heading_contact']            = 'Επικοινωνία Υποστήριξης';

// Text
$_['text_extension']             = 'Επεκτάσεις';
$_['text_success']               = 'Επιτυχία: Έχετε τροποποιήσει τη χρέωση Αντικαταβολής!';
$_['text_edit']                  = 'Επεξεργασία Χρέωσης Αντικαταβολής';
$_['text_getting_started']       = '<p><strong>Επισκόπηση:</strong> Η Playful Sparkle - Χρέωση Αντικαταβολής για το OpenCart 4.x επιτρέπει στους κατόχους καταστημάτων να προσθέσουν αυτόματα μια ρυθμιζόμενη χρέωση σε παραγγελίες που ολοκληρώνονται με την μέθοδο πληρωμής Αντικαταβολή. Αυτό βοηθά στην αντιστάθμιση των εξόδων συναλλαγής ή των επιπλέον τελών που σχετίζονται με την Αντικαταβολή, ενισχύοντας την ευελιξία και τον έλεγχο των τελικών συνολικών παραγγελιών.</p><p><strong>Απαιτήσεις:</strong> OpenCart 4.x+, PHP 7.4+ ή ανώτερο.</p>';
$_['text_setup']                 = '<p>Για να ρυθμίσετε τη χρέωση, εισάγετε το επιθυμητό ποσό χρέωσης που θα εφαρμοστεί κατά την ολοκλήρωση της παραγγελίας, επιλέξτε την κατάλληλη κλάση φόρου και ενεργοποιήστε την επέκταση. Μόλις ρυθμιστεί, η χρέωση θα περιλαμβάνεται αυτόματα όταν ο πελάτης επιλέξει την μέθοδο Αντικαταβολής κατά την ολοκλήρωση της παραγγελίας.</p>';
$_['text_faq']                   = '<details><summary>Μπορώ να εφαρμόσω διαφορετικές χρεώσεις για άλλες μεθόδους πληρωμής;</summary>Όχι, αυτή η επέκταση εφαρμόζει χρέωση μόνο όταν επιλέγεται η μέθοδος πληρωμής Αντικαταβολή.</details><details><summary>Η χρέωση θα εμφανίζεται ξεχωριστά στη σύνοψη της παραγγελίας;</summary>Ναι, η χρέωση εμφανίζεται ως ξεχωριστό στοιχείο στη διάρθρωση του συνολικού ποσού της παραγγελίας κατά την ολοκλήρωση της παραγγελίας.</details>';
$_['text_contact']               = '<p>Για περαιτέρω βοήθεια, παρακαλούμε επικοινωνήστε με την ομάδα υποστήριξής μας:</p><ul><li><strong>Επικοινωνία:</strong> <a href="mailto:%s">%s</a></li><li><strong>Τεκμηρίωση:</strong> <a href="%s" target="_blank" rel="noopener noreferrer">Τεκμηρίωση Χρήστη</a></li></ul>';

// Tab
$_['tab_general']                = 'Γενικά';
$_['tab_help_and_support']       = 'Βοήθεια &amp; Υποστήριξη';

// Entry
$_['entry_fee']                  = 'Χρέωση';
$_['entry_tax_class']            = 'Κλάση Φόρου';
$_['entry_status']               = 'Κατάσταση';
$_['entry_sort_order']           = 'Σειρά Ταξινόμησης';

// Error
$_['error_total_ps_cod_fee_fee'] = 'Η χρέωση δεν μπορεί να είναι κενή, μικρότερη ή ίση με το μηδέν';

// Error
$_['error_permission']           = 'Προειδοποίηση: Δεν έχετε άδεια να τροποποιήσετε τη χρέωση Αντικαταβολής!';
